const stockData = {
  "农林牧渔": {
    "饲料": [
      {
        "name": "海大集团",
        "code": "sz002311"
      },
      {
        "name": "天马科技",
        "code": "sh603668"
      }
    ],
    "养猪": [
      {
        "name": "牧原股份",
        "code": "sz002714"
      },
      {
        "name": "温氏股份",
        "code": "sz300498"
      },
      {
        "name": "新希望",
        "code": "sz000876"
      },
      {
        "name": "正邦科技",
        "code": "sz002157"
      },
      {
        "name": "天邦股份",
        "code": "sz002124"
      },
      {
        "name": "天康生物",
        "code": "sz002100"
      },
      {
        "name": "大北农",
        "code": "sz002385"
      },
      {
        "name": "唐人神",
        "code": "sz002567"
      },
      {
        "name": "新五丰",
        "code": "sh600975"
      },
      {
        "name": "傲农生物",
        "code": "sh603363"
      }
    ],
    "养禽": [
      {
        "name": "益生股份",
        "code": "sz002458"
      },
      {
        "name": "民和股份",
        "code": "sz002234"
      },
      {
        "name": "圣农发展",
        "code": "sz002299"
      },
      {
        "name": "仙坛股份",
        "code": "sz002746"
      },
      {
        "name": "立华股份",
        "code": "sz300761"
      },
      {
        "name": "华英农业",
        "code": "sz002321"
      }
    ],
    "动物疫苗": [
      {
        "name": "生物股份",
        "code": "sh600201"
      },
      {
        "name": "中牧股份",
        "code": "sh600195"
      },
      {
        "name": "普莱柯",
        "code": "sh603566"
      },
      {
        "name": "瑞普生物",
        "code": "sz300119"
      }
    ],
    "宠物食品": [
      {
        "name": "中宠股份",
        "code": "sz002891"
      },
      {
        "name": "佩蒂股份",
        "code": "sz300673"
      }
    ],
    "育种": [
      {
        "name": "荃银高科",
        "code": "sz300087"
      },
      {
        "name": "隆平高科",
        "code": "sz000998"
      },
      {
        "name": "登海种业",
        "code": "sz002041"
      },
      {
        "name": "大北农",
        "code": "sz002385"
      }
    ],
    "种子": [
      {
        "name": "万向德农",
        "code": "sh600371"
      },
      {
        "name": "丰乐种业",
        "code": "sz000713"
      },
      {
        "name": "敦煌种业",
        "code": "sh600354"
      },
      {
        "name": "神农科技",
        "code": "sz300189"
      },
      {
        "name": "苏垦农发",
        "code": "sh601952"
      }
    ],
    "贸易": [
      {
        "name": "农发种业",
        "code": "sh600313"
      }
    ],
    "生产": [
      {
        "name": "北大荒",
        "code": "sh600598"
      }
    ]
  },
  "房地产": {
    "开发": [
      {
        "name": "万科",
        "code": "sz000002"
      },
      {
        "name": "保利地产",
        "code": "sh600048"
      },
      {
        "name": "中国金茂",
        "code": ""
      },
      {
        "name": "融创中国",
        "code": ""
      },
      {
        "name": "华侨城",
        "code": "sz000069"
      },
      {
        "name": "新城控股",
        "code": "sh601155"
      },
      {
        "name": "碧桂园",
        "code": ""
      },
      {
        "name": "金地集团",
        "code": "sh600383"
      },
      {
        "name": "世茂房地产",
        "code": ""
      },
      {
        "name": "中南建设",
        "code": "sz000961"
      },
      {
        "name": "金科股份",
        "code": "sz000656"
      },
      {
        "name": "龙湖集团",
        "code": "sz000578"
      }
    ],
    "物业": [
      {
        "name": "新大正",
        "code": "sz002968"
      },
      {
        "name": "碧桂园服务",
        "code": ""
      },
      {
        "name": "永升生活服务",
        "code": ""
      },
      {
        "name": "新城悦服务",
        "code": ""
      },
      {
        "name": "保利物业",
        "code": ""
      },
      {
        "name": "招商积余",
        "code": "sz001914"
      },
      {
        "name": "雅生活服务",
        "code": ""
      },
      {
        "name": "蓝光嘉宝服务",
        "code": ""
      }
    ]
  },
  "家电家居": {
    "家电": [
      {
        "name": "格力电器",
        "code": "sz000651"
      },
      {
        "name": "美的集团",
        "code": "sz000333"
      },
      {
        "name": "海尔智家",
        "code": "sh600690"
      },
      {
        "name": "老板电器",
        "code": "sz002508"
      },
      {
        "name": "华帝股份",
        "code": "sz002035"
      },
      {
        "name": "小熊电器",
        "code": "sz002959"
      },
      {
        "name": "海信家电",
        "code": "sz000921"
      },
      {
        "name": "浙江美大",
        "code": "sz002677"
      },
      {
        "name": "九阳股份",
        "code": "sz002242"
      },
      {
        "name": "苏泊尔",
        "code": "sz002032"
      },
      {
        "name": "爱仕达",
        "code": "sz002403"
      },
      {
        "name": "科沃斯",
        "code": "sh603486"
      }
    ],
    "家居": [
      {
        "name": "顾家家居",
        "code": "sh603816"
      },
      {
        "name": "敏华控股",
        "code": "sh600653"
      },
      {
        "name": "大亚圣象",
        "code": "sz000910"
      },
      {
        "name": "欧派家居",
        "code": "sh603833"
      },
      {
        "name": "索菲亚",
        "code": "sz002572"
      },
      {
        "name": "江山欧派",
        "code": "sh603208"
      },
      {
        "name": "蒙娜丽莎",
        "code": "sz002918"
      },
      {
        "name": "帝欧家居",
        "code": "sz002798"
      },
      {
        "name": "坚朗五金",
        "code": "sz002791"
      },
      {
        "name": "志邦家居",
        "code": "sh603801"
      },
      {
        "name": "海鸥住工",
        "code": "sz002084"
      },
      {
        "name": "惠达卫浴",
        "code": "sh603385"
      }
    ]
  },
  "建筑建材": {
    "建筑工程": [
      {
        "name": "精工钢构",
        "code": "sh600496"
      },
      {
        "name": "鸿路钢构",
        "code": "sz002541"
      },
      {
        "name": "东南网架",
        "code": "sz002135"
      },
      {
        "name": "富煌钢构",
        "code": "sz002743"
      },
      {
        "name": "亚厦股份",
        "code": "sz002375"
      },
      {
        "name": "中国铁建",
        "code": "sh601186"
      },
      {
        "name": "中国建筑",
        "code": "sh601668"
      }
    ],
    "建材": [
      {
        "name": "海螺水泥",
        "code": "sh600585"
      },
      {
        "name": "华新水泥",
        "code": "sh600801"
      },
      {
        "name": "中国建材",
        "code": "sh601668"
      },
      {
        "name": "塔牌集团",
        "code": "sz002233"
      },
      {
        "name": "兔宝宝",
        "code": "sz002043"
      },
      {
        "name": "三棵树",
        "code": "sh603737"
      },
      {
        "name": "东方雨虹",
        "code": "sz002271"
      },
      {
        "name": "中国巨石",
        "code": "sh600176"
      },
      {
        "name": "旗滨集团",
        "code": "sh601636"
      },
      {
        "name": "北新建材",
        "code": "sz000786"
      },
      {
        "name": "震安科技",
        "code": "sz300767"
      },
      {
        "name": "苏博特",
        "code": "sh603916"
      },
      {
        "name": "全筑股份",
        "code": "sh603030"
      },
      {
        "name": "永兴材料",
        "code": "sz002756"
      }
    ]
  },
  "有色金属": {
    "铝": [
      {
        "name": "中国铝业",
        "code": "sh601600"
      },
      {
        "name": "中国宏桥",
        "code": ""
      },
      {
        "name": "索通发展",
        "code": "sh603612"
      },
      {
        "name": "云铝股份",
        "code": "sz000807"
      }
    ],
    "锌": [
      {
        "name": "中金岭南",
        "code": "sz000060"
      },
      {
        "name": "驰宏锌锗",
        "code": "sh600497"
      },
      {
        "name": "西藏珠峰",
        "code": "sh600338"
      },
      {
        "name": "盛屯矿业",
        "code": "sh600711"
      }
    ],
    "铜": [
      {
        "name": "紫金矿业",
        "code": "sh601899"
      },
      {
        "name": "云南铜业",
        "code": "sz000878"
      },
      {
        "name": "江西铜业",
        "code": "sh600362"
      },
      {
        "name": "白银有色",
        "code": "sh601212"
      }
    ],
    "新能源金属": [
      {
        "name": "洛阳钼业",
        "code": "sh603993"
      },
      {
        "name": "华友钴业",
        "code": "sh603799"
      },
      {
        "name": "赣锋锂业",
        "code": "sz002460"
      },
      {
        "name": "云南锗业",
        "code": "sz002428"
      }
    ],
    "黄金": [
      {
        "name": "山东黄金",
        "code": "sh600547"
      }
    ]
  },
  "汽车": {
    "整车": [
      {
        "name": "中国重汽",
        "code": "sz000951"
      },
      {
        "name": "一汽解放",
        "code": "sz000800"
      },
      {
        "name": "广汽集团",
        "code": "sh601238"
      },
      {
        "name": "吉利汽车",
        "code": "sh601279"
      }
    ],
    "零部件": [
      {
        "name": "潍柴动力",
        "code": "sz000338"
      },
      {
        "name": "威孚高科",
        "code": "sz000581"
      },
      {
        "name": "万里扬",
        "code": "sz002434"
      },
      {
        "name": "玲珑轮胎",
        "code": "sh601966"
      },
      {
        "name": "赛轮股份",
        "code": "sh603283"
      }
    ],
    "汽车服务": [
      {
        "name": "中国汽研",
        "code": "sh601965"
      }
    ]
  },
  "纺织制造": {
    "棉印染": [
      {
        "name": "航民股份",
        "code": "sh600987"
      },
      {
        "name": "华纺股份",
        "code": "sh600448"
      }
    ],
    "棉色织": [
      {
        "name": "鲁泰A",
        "code": "sz000726"
      },
      {
        "name": "联发股份",
        "code": "sz002394"
      },
      {
        "name": "黑牡丹",
        "code": "sh600510"
      }
    ],
    "棉色纺纱": [
      {
        "name": "华孚时尚",
        "code": "sz002042"
      },
      {
        "name": "百隆东方",
        "code": "sh601339"
      }
    ],
    "服装加工": [
      {
        "name": "申洲国际",
        "code": ""
      },
      {
        "name": "晶苑国际",
        "code": ""
      },
      {
        "name": "健盛集团",
        "code": "sh603558"
      },
      {
        "name": "际华集团",
        "code": "sh601718"
      },
      {
        "name": "超盈国际控股",
        "code": ""
      },
      {
        "name": "维珍妮",
        "code": ""
      }
    ],
    "服装辅料": [
      {
        "name": "伟星股份",
        "code": "sz002003"
      },
      {
        "name": "浔兴股份",
        "code": "sz002098"
      }
    ]
  },
  "动力电池": {
    "电池制造": [
      {
        "name": "宁德时代",
        "code": "sz300750"
      },
      {
        "name": "比亚迪",
        "code": "sz002594"
      },
      {
        "name": "欣旺达",
        "code": "sz300207"
      },
      {
        "name": "亿纬锂能",
        "code": "sz300014"
      },
      {
        "name": "国轩高科",
        "code": "sz002074"
      }
    ],
    "正极材料": [
      {
        "name": "容百科技",
        "code": "sh688005"
      },
      {
        "name": "当升科技",
        "code": "sz300073"
      },
      {
        "name": "德方纳米",
        "code": "sz300769"
      },
      {
        "name": "华友钴业",
        "code": "sh603799"
      },
      {
        "name": "格林美",
        "code": "sz002340"
      },
      {
        "name": "光华科技",
        "code": "sz002741"
      },
      {
        "name": "厦门钨业",
        "code": "sh600549"
      },
      {
        "name": "杉杉股份",
        "code": "sh600884"
      },
      {
        "name": "道氏技术",
        "code": "sz300409"
      }
    ],
    "负极材料": [
      {
        "name": "璞泰来",
        "code": "sh603659"
      },
      {
        "name": "中科电气",
        "code": "sz300035"
      }
    ],
    "隔膜": [
      {
        "name": "恩捷股份",
        "code": "sz002812"
      },
      {
        "name": "星源材质",
        "code": "sz300568"
      },
      {
        "name": "中材科技",
        "code": "sz002080"
      }
    ],
    "电解液": [
      {
        "name": "新宙邦",
        "code": "sz300037"
      },
      {
        "name": "多氟多",
        "code": "sz002407"
      }
    ],
    "设备制造": [
      {
        "name": "赢合科技",
        "code": "sz300457"
      },
      {
        "name": "先导智能",
        "code": "sz300450"
      },
      {
        "name": "科恒股份",
        "code": "sz300340"
      },
      {
        "name": "杭可科技",
        "code": "sh688006"
      }
    ]
  },
  "金融": {
    "银行": [
      {
        "name": "招商银行",
        "code": "sh600036"
      },
      {
        "name": "民生银行",
        "code": "sh600016"
      },
      {
        "name": "交通银行",
        "code": "sh601328"
      },
      {
        "name": "平安银行",
        "code": "sz000001"
      }
    ],
    "非银": [
      {
        "name": "中信证券",
        "code": "sh600030"
      },
      {
        "name": "中信建投",
        "code": "sh601066"
      },
      {
        "name": "天风证券",
        "code": "sh601162"
      },
      {
        "name": "中国平安",
        "code": "sh601318"
      },
      {
        "name": "中国太保",
        "code": "sh601601"
      },
      {
        "name": "中国人寿",
        "code": "sh601628"
      },
      {
        "name": "东方财富",
        "code": "sz300059"
      }
    ]
  },
  "工程机械": {
    "重型机械": [
      {
        "name": "三一重工",
        "code": "sh600031"
      },
      {
        "name": "中联重科",
        "code": "sz000157"
      },
      {
        "name": "建设机械",
        "code": "sh600984"
      }
    ]
  },
  "电子": {
    "电子制造": [
      {
        "name": "立讯精密",
        "code": "sz002475"
      },
      {
        "name": "海康威视",
        "code": "sz002415"
      }
    ]
  },
  "终端服装": {
    "男装": [
      {
        "name": "海澜之家",
        "code": "sh600398"
      },
      {
        "name": "雅戈尔",
        "code": "sh600177"
      },
      {
        "name": "报喜鸟",
        "code": "sz002154"
      },
      {
        "name": "摩登大道",
        "code": "sz002656"
      },
      {
        "name": "九牧王",
        "code": "sh601566"
      },
      {
        "name": "太平鸟",
        "code": "sh603877"
      },
      {
        "name": "七匹狼",
        "code": "sz002029"
      }
    ],
    "女装": [
      {
        "name": "拉夏贝尔",
        "code": "sh603157"
      },
      {
        "name": "日播时尚",
        "code": "sh603196"
      },
      {
        "name": "地素时尚",
        "code": "sh603587"
      },
      {
        "name": "歌力思",
        "code": "sh603808"
      },
      {
        "name": "安正时尚",
        "code": "sh603839"
      },
      {
        "name": "朗姿股份",
        "code": "sz002612"
      },
      {
        "name": "波司登",
        "code": ""
      }
    ],
    "童装": [
      {
        "name": "森马服饰",
        "code": "sz002563"
      },
      {
        "name": "安奈儿",
        "code": "sz002875"
      },
      {
        "name": "起步股份",
        "code": "sh603557"
      },
      {
        "name": "金发拉比",
        "code": "sz002762"
      }
    ],
    "家纺": [
      {
        "name": "罗莱生活",
        "code": "sz002293"
      },
      {
        "name": "富安娜",
        "code": "sz002327"
      },
      {
        "name": "梦洁股份",
        "code": "sz002397"
      },
      {
        "name": "水星家纺",
        "code": "sh603365"
      },
      {
        "name": "多喜爱",
        "code": ""
      }
    ],
    "大众休闲": [
      {
        "name": "海澜之家",
        "code": "sh600398"
      },
      {
        "name": "森马服饰",
        "code": "sz002563"
      },
      {
        "name": "美邦服饰",
        "code": "sz002269"
      },
      {
        "name": "太平鸟",
        "code": "sh603877"
      }
    ],
    "运动服装": [
      {
        "name": "安踏体育",
        "code": ""
      },
      {
        "name": "李宁",
        "code": ""
      },
      {
        "name": "361度",
        "code": ""
      },
      {
        "name": "特步国际",
        "code": ""
      }
    ]
  },
  "不锈钢": {
    "冶炼及压延": [
      {
        "name": "太钢不锈",
        "code": "sz000825"
      },
      {
        "name": "久立特材",
        "code": "sz002318"
      },
      {
        "name": "永兴材料",
        "code": "sz002756"
      },
      {
        "name": "武进不锈",
        "code": "sh603878"
      },
      {
        "name": "甬金股份",
        "code": "sh603995"
      }
    ],
    "终端应用": [
      {
        "name": "上海机电",
        "code": "sh600835"
      },
      {
        "name": "广日股份",
        "code": "sh600894"
      },
      {
        "name": "康力电梯",
        "code": "sz002367"
      },
      {
        "name": "梅轮电梯",
        "code": "sh603321"
      },
      {
        "name": "中国化学",
        "code": "sh601117"
      },
      {
        "name": "大明国际",
        "code": ""
      }
    ]
  },
  "食品饮料": {
    "氨基酸": [
      {
        "name": "梅花生物",
        "code": "sh600873"
      }
    ],
    "粉丝": [
      {
        "name": "双塔食品",
        "code": "sz002481"
      }
    ],
    "功能糖": [
      {
        "name": "保龄宝",
        "code": "sz002286"
      }
    ],
    "调味品": [
      {
        "name": "莲花健康",
        "code": "sh600186"
      },
      {
        "name": "阜丰集团",
        "code": ""
      },
      {
        "name": "千禾味业",
        "code": "sh603027"
      },
      {
        "name": "醋化股份",
        "code": "sh603968"
      },
      {
        "name": "海天味业",
        "code": "sh603288"
      }
    ],
    "白酒": [
      {
        "name": "贵州茅台",
        "code": "sh600519"
      },
      {
        "name": "五粮液",
        "code": "sz000858"
      }
    ],
    "屠宰肉食": [
      {
        "name": "双汇发展",
        "code": "sz000895"
      },
      {
        "name": "华统股份",
        "code": "sz002840"
      },
      {
        "name": "龙大肉食",
        "code": "sz002726"
      },
      {
        "name": "湘佳股份",
        "code": "sz002982"
      }
    ],
    "乳业": [
      {
        "name": "伊利股份",
        "code": "sh600887"
      },
      {
        "name": "光明乳业",
        "code": "sh600597"
      },
      {
        "name": "燕塘乳业",
        "code": "sz002732"
      }
    ]
  },
  "化工": {
    "维生素": [
      {
        "name": "新和成",
        "code": "sz002001"
      },
      {
        "name": "浙江医药",
        "code": "sh600216"
      }
    ],
    "化肥农药": [
      {
        "name": "史丹利",
        "code": "sz002588"
      }
    ],
    "原料": [
      {
        "name": "中粮科技",
        "code": "sz000930"
      }
    ]
  },
  "制药": {
    "葡萄糖": [
      {
        "name": "哈药股份",
        "code": "sh600664"
      }
    ]
  },
  "糖业": {
    "制糖及糖蜜": [
      {
        "name": "南宁糖业",
        "code": "sz000911"
      },
      {
        "name": "中粮糖业",
        "code": "sh600737"
      },
      {
        "name": "安琪酵母",
        "code": "sh600298"
      }
    ]
  }
};
export default stockData;